package shintaido.teachingWay

/**
 * 自分のどこが間違っているかわからない時に間違いを発見するクラス
 * パワー練習をっする気力はないけれど、正確さに気を配れる力がある場合かつ努力をしたい場合に呼び出す
 */
interface Improve正確でないことを自覚する力 {

    /**
     * もっと栄光
     * スキーで栄光しても何が正確か最初はわからなかった
     * どこに乗れば転ばないのかわからん
     * ただ地球の重心から体の重心を離すわけじゃない
     * 栄光がスキーだとどのように変形するのか？を書けるのか？
     * 前後方向と左右方向の天相がわかれる
     * 正確にしたいをユーザー側の入力にするのか？天相したいを入力にするのが適切なのか？
     * 当てはめた結論をユーザーは知りたい。
     * 外足インエッジの上に乗ることが　天相の観点からなんで絶対に正しいのかをすぐに考えつきたい。
     * 内足にのったら怪我しやすい。でもそれがわからずに挑戦してしまう。
     * 怪我をどうやって避けて、正しい結論にたどり着けるのかが知りたい。
     */
    fun handle()

}