package shintaido.teachingWay

/**
 * 自分のどこが間違っているかわからない時に間違いを発見するクラス
 */
interface Improve正確でないことを自覚する力 {

    /**
     * もっと栄光
     * スキーで栄光しても何が正確か最初はわからなかった
     * どこに乗れば転ばないのかわからん
     * ただ地球の重心から体の重心を離すわけじゃない
     * 栄光がスキーだとどのように変形するのか？を書けるのか？
     * 前後方向と左右方向の天相がわかれる
     * 正確にしたいをユーザー側の入力にするのか？天相したいを入力にするのが適切なのか？
     * 当てはめた結論をユーザーは知りたい。
     * 外足インエッジの上に乗ることが　天相の観点からなんで絶対に正しいのかをすぐに考えつきたい。
     * 内足にのったら怪我しやすい。でもそれがわからずに挑戦してしまう。
     * 怪我をどうやって避けて、正しい結論にたどり着けるのかが知りたい。
     */
    fun handle()

    /**
     * 前後方向の正しさ
     * スキーのパウダーだとつんのめるときの処理のためにより踵荷重で滑るのだが、
     * それは剛体ではなくて　流体の上を滑るからなんだろうか？
     * それをどうやって　天相から学習するんだ？学習できるとどうやって信じるんだ？
     * 一度できると思える知識が失われたら信じることができない。それは通貨として知識の再生方法が保証されていない状態である。
     * 保証されていない状態をなんとかしたい。解決したい。
     * ストレート内倒と普通　どれぐらい違うの？
     */
    fun handle前後()

}