import bodyAnalysis.HumanBody

// 栄養摂取時の判断を行うクラス
// 食べ過ぎないかどうかを判定する　恐怖と快楽の対立を書く
interface GetNutrition {
    val v満腹中枢が動いている人体: 満腹中枢が動いている人体
    val v貯蓄性の栄養: 脂肪を分解して糖分を生成する栄養素

    fun 栄養補給判断する(): Boolean{
        if (v満腹中枢が動いている人体.満腹度 < v満腹中枢が動いている人体.満腹) {
            // 筋肉の回復のための栄養素など、長期的な回復を阻害する要素があるか？
            // 炭水化物で糖を生成して筋肉の分解を防ぐことができていれば満腹と判断　無駄に満腹になるけど、体に脂肪がある場合は接種しない
            // 満腹になる分だけ調理できないのが問題。そば一玉調理するのかもう一玉調理するのかで無理に食べようとしてしまうのを不防げrう。チューハイが缶だから開けたら飲みきらなきゃいけない感覚になるのと同じ。
            // お腹が空いてしまってタンパク質が分解されていると感じる時にビタミンを使って脂肪を分解して糖を生成できるかが問題。そこを用意しておく。
            return true
        } else {
            return false
        }
    }
}
interface 脂肪を分解して糖分を生成する栄養素{

}
interface 満腹中枢が動いている人体 : HumanBody {
    val 満腹度: Int
    val 満腹: Int
}
interface 栄養補給判断{


}