package ridingSports.snowSports

/**
 * ずらし
 */
interface Skidding {
    /**
     * 接雪している点が一点だとして　てこのモデルでずらしを説明する
     *  回す力　雪面に対してヨーイング方向の抵抗
     */
    val rotationPower: Float
    val rotationResistance:Float
    /**
     * 回転抵抗を増やす要素
     * 後ろに体重かけるとかいろいろあるけど、すべての条件を計算し尽くせない
     * 体重移動でテコの支点が変わるのを説明するか
     * ターン外に押す力が内に押す力よりも強い
     * 内にずらすほうが外にずらすよりも簡単
     * 前を内側にずらそうとしても　エッジが引っかかってずれないから　後ろを外にずらす
     * 全てのエッジが引っかかっているか外側にずれている状態にしたい。
     * 外足の雪面コンタクトが強い
     * ゆえに雪面コンタクトを後ろにすると、回す力が弱くなる
     * これを表現したい。
     */


    /**
     * 角速度を取得
     */
    fun angularVelocity():Float

    /**
     * ずらし操作
     *
     */
    fun handle()
}