package ridingSports.singleRidingMaterialPumping

/**
 * 平面でポンピングする
 * ターン前半を長くとってそのときにスケーティングして、
 * ターンマックスから後半までピッチングモーメントを強くしながら次のターンに行く
 * ポンピングする局面を制限する必要がある？
 * 足を蹴った場合前にスラストする効率が高い局面を長くする
 * つま先がターン外に向く時間を長くする
 * こんな抽象的な書き方で立ち上がる長いターンが動けるのかな
 * しゃがんで吸収してエッジグリップを低く保っても結局FL方向のグリップは下げなきゃいけないから落とされる。
 * ターン前半でグリップが低くてもいいのは重力との兼ね合いだけなのか？
 * グリップが無限だったとしても　前半で縮んでターンマックスでのばすのが正しいのか？
 * エッジグリップが無限だったら、前半で横に行く必要がないので高くする動機がなくなっる
 * スケーティングで押す側が引く側よりも強い
 */
interface CarvingFlatPumpable : SingleMaterialPumpable {
}